vegeta-cli/src/vegeta/aeromant/templates/rotor_mrf/com/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case — values in {{...}} are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform {{OMEGA_INLET}};

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform {{OMEGA_INLET}};
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform {{OMEGA_INLET}};
        value           uniform {{OMEGA_INLET}};
    }
    sides
    {
        type            slip;
    }
    "body.*"
    {
        type            omegaWallFunction;
        value           uniform {{OMEGA_INLET}};
    }
}

// ************************************************************************* //
